update: changelog & plan
